---
kind: other
id: Methods.T:Autodesk.Revit.DB.FormattedText
source: html/35f33399-cf65-08b2-e022-f2e389e834fe.htm
---
# FormattedText Methods

Returns a TextRange object that represents the entire text.